var quiz = {
  // (A) PROPERTIES 
  // (A1) QUESTIONS & ANSWERS
  // Q = QUESTION, O = OPTIONS, A = CORRECT ANSWER
  data: [
  {
    q : "آیا سن شما 60 سال و یا بالاتر است؟",
    o : [
      "بله",
      "خیر",
    ],
    a : 0,
    f : "خطر ابتلا به پوکی استخوان با افزایش سن زیادتر می شود. حتی اگر هیچکدام از ریسک فاکتورهای پوکی استخوان را ندارید، ولی خانم بالای 60 سال و یا آقای بالای 70 سال هستید، حتما باید برای چک آپ سلامت استخوان به پزشک مراجعه کنید.",
  },
  {
    q : "آیا پس از 50 سالگی شما دچار یک شکستگی استخوان پس از یک ضربه ناچیز یا زمین خوردگی شده‌اید؟",
    o : [
      "بله",
      "خیر",
    ],
    a : 0,
    f : "افراد بالای 50 سالی که قبلاً سابقه شکستگی‌های استخوانی ناشی از پوکی استخوان دارند، 2 برابر افراد بدون سابقه شکستگی در معرض خطر بروز شکستگی‌های مجدد در آینده قرار دارند. در واقع نیمی از بیمارانی که به علت پوکی استخوان دچار شکستگی لگن می‌شوند، قبلاً سابقه شکستگی استخوانی در نقاط دیگر بدن را نیز داشته‌اند. بنابراین اگر شما سابقه شکستگی دارید، بسیار مهم است که با پزشک خود در این باره مشورت کنید که چگونه باید از بروز شکستگی‌های استخوانی در آینده پیشگیری نمایید."
  },
  {
    q : "آیا کمبود وزن دارید؟ </br> (شاخص توده بدنی کمتر از 19 و یا وزن کمتر از 57 کیلوگرم)",
    o : [
      "بله",
      "خیر",
    ],
    a : 0,
    f : "افرادی که کمبود وزن دارند، مواد معدنی و ویتامین‌های مورد نیاز و ضروری را به مقدار کافی دریافت نمی‌کنند. توصیه می‌شود وزن خود را متعادل نگه دارید؛ چون همانطور که اضافه وزن به بدن آسیب می‌رساند، کمبود وزن هم مشکل‌ساز است."
  },
  {
    q : "آیا پس از 40 سالگی بیش از 4 سانتی‌متر از قدتان کاهش یافته است؟",
    o : [
      "بله",
      "خیر",
      "نمیدانم",
    ],
    a : 0,
    f : "کاهش قد بیش از 4 سانتی‌متر در بزرگسالان معمولا به دلیل شکستگی‌های مهره ناشی از پوکی استخوان رخ می‌دهد. همه شکستگی‌های مهره‌ای دردناک نیستند، این بدان معنی است که ممکن است افراد از شکستگی مهره‌های خود باخبر نباشند."
  },
  {
    q : "آیا هیچ کدام از والدین شما دچار شکستگی لگن پس از یک زمین خوردگی ساده یا ضربه ناچیز شده‌اند؟",
    o : [
      "بله",
      "خیر",
    ],
    a : 0,
    f : "ژنتیک هر فرد در رسیدن به حداکثر میزان توده استخوانی در دوران جوانی و در از دست دادن آن در دوران سالمندی و یا بعد از یائسگی نقش دارد. علاوه بر حداکثر میزان تراکم توده استخوانی، خطر بروز شکستگی‌های ناشی از پوکی استخوان در افرادی که والدین آن‌ها به پوکی استخوان مبتلا بودند؛ بیش‌تر است. بنابراین اگر پدر و مادر شما به پوکی استخوان مبتلا هستند و یا از شکستکی لگن رنج می‌برند؛ شما نیز در مقایسه با دیگران بیش‌تر در معرض خطر مبتلا شدن به پوکی استخوان و شکستگی‌های ناشی از آن قرار دارید."
  },
  {
    q : "آیا شما از یکی از بیماری‌های زیر رنج می برید؟\
	<br/>رماتوئید آرتریت، سوء هاضمه مزمن گوارش، کبد، کیسه صفرا، دیابت، نارسایی کلیوی، فشار خون، کم‌کاری یا پرکاری تیروئید یا پاراتیروئید، و یا بیماری‌های زمین‌گیر کننده",
    o : [
      "بله",
      "خیر",
      "نمی دانم",
    ],
    a : 0,
    f : "برخی اختلالات پزشکی با احتمال افزایش ابتلا به پوکی استخوان و شکستگی ارتباط دارند. اگر هرکدام از شرایط ذکر شده فوق را دارید، توصیه می شود در مورد سلامت استخوان های خود با پزشک خود مشورت کنید.",
  },
  {
    q : "آیا شما داروهای زیر را مصرف می کنید؟\
	</br> مهارکننده‌های آروماتاز (این دارو در درمان سرطان پستان مصرف می شود)، داروهای ضد انعقاد خون، داروهای ضد صرع، مهار کننده‌های پمپ پروتون (این دارو در درمان بیماری های گوارشی استفاده می‌شود)، گلوکوکورتیکوئیدها (مانند پردنیزون و کورتیزون)، داروهای سرکوب کننده‌های سیستم ایمنی،  درمان با هورمونهای تیروئیدی در دوزهای بالا",
    o : [
      "بله",
	  "خیر",
	  "نمی دانم",
    ],
    a : 0,
    f : "برخی داروها دارای عوارض جانبی بر روی سلامت استخوان‌ها هستند. این داروها به طور مستقیم باعث ضعیف شدن استخوان‌های بدن می‌شوند و یا احتمال بروز شکستگی‌های استخوانی در اثر زمین خوردن یا وارد شدن ضربه به استخوان‌ها افزایش می‌دهند. اگر شما هر یک از داروهای لیست زیر را مصرف می‌کنید، توصیه می‌شود که در مورد وضعیت سلامت استخوان‌های خود با پزشک خود مشورت نمایید.",
  },
  {
    q : "آیا میزان مصرف الکل در شما بیش از میزان مصرف مجاز است؟ (بیش از دو واحد در روز)",
    o : [
      "بله",
      "خیر",
    ],
    a : 0,
    f : "مصرف طولانی مدت مقادیر بالای الکل به ویژه در سنین پایین می‌تواند اثرات بسیار نامطلوبی بر سلامت استخوان‌ها بگذارد و احتمال ابتلا به پوکی استخوان را در سنین بالاتر افزایش دهد."
  },
    {
    q : "آیا در حال حاضر سیگار مصرف می‌کنید؟ یا در گذشته مصرف می‌کردید؟",
    o : [
      "بله",
      "خیر",
    ],
    a : 0,
    f : "سیگار یک عامل بسیار مهم در ایجاد و تسریع پوکی استخوان در افراد سیگاری و افراد غیرسیگاریِ در معرض دود سیگار است.</br> افراد مسن که سیگاری هستند، 30 تا 40 درصد بیش از همسالان غیرسیگاری خود احتمال شکستگی لگن دارند."
  }
  ],

  // (A2) HTML ELEMENTS
  hWrap: null, // HTML quiz container
  hQn: null, // HTML question wrapper
  hAns: null, // HTML answers wrapper
  hFn: null, // Comment
  
  
  // (A3) GAME FLAGS
  now: 0, // current question
  score: 0, // current score

  // (B) INIT QUIZ HTML
  init: function(){
    // (B1) WRAPPER
    quiz.hWrap = document.getElementById("quizWrap");

    // (B2) QUESTIONS SECTION
    quiz.hQn = document.createElement("div");
    quiz.hQn.id = "quizQn";
    quiz.hWrap.appendChild(quiz.hQn);

    // (B3) ANSWERS SECTION
    quiz.hAns = document.createElement("div");
    quiz.hAns.id = "quizAns";
    quiz.hWrap.appendChild(quiz.hAns);

    quiz.hFn = document.createElement("div");
    quiz.hFn.id = "quizFn";
    quiz.hWrap.appendChild(quiz.hFn);

    // (B4) GO!
    quiz.draw();
  },

  // (C) DRAW QUESTION
  draw: function(){
    // (C1) QUESTION
    quiz.hQn.innerHTML = quiz.data[quiz.now].q;

    // (C2) OPTIONS
    quiz.hAns.innerHTML = "";
    for (let i in quiz.data[quiz.now].o) {
      let radio = document.createElement("input");
      radio.type = "radio";
      radio.name = "quiz";
      radio.id = "quizo" + i;
      quiz.hAns.appendChild(radio);
      let label = document.createElement("label");
      label.innerHTML = quiz.data[quiz.now].o[i];
      label.setAttribute("for", "quizo" + i);
      label.dataset.idx = i;
      label.addEventListener("click", quiz.select);
      quiz.hAns.appendChild(label);
    }
	quiz.hFn.innerHTML = quiz.data[quiz.now].f;
  },
  
  // (D) OPTION SELECTED
  select: function(){
    // (D1) DETACH ALL ONCLICK
    let all = quiz.hAns.getElementsByTagName("label");
    for (let label of all) {
      label.removeEventListener("click", quiz.select);
    }

    // (D2) CHECK IF CORRECT
    let correct = this.dataset.idx == quiz.data[quiz.now].a;
    if (correct) { 
      quiz.score++; 
      this.classList.add("correct");
    } else {
      this.classList.add("wrong");
    }
  
    // (D3) NEXT QUESTION OR END GAME
    quiz.now++;
    setTimeout(function(){
      if (quiz.now < quiz.data.length) { quiz.draw(); } 
      else {
        quiz.hQn.innerHTML = `شما به  ${quiz.score} ریسک فاکتور از ${quiz.data.length} ریسک فاکتور موجود در این پرسشنامه پاسخ مثبت داده‌اید!`;
        quiz.hAns.innerHTML = "پاسخ مثبت به هریک از سؤالات این پرسشنامه به این معنی است که شما از نظر پزشکی در معرض خطر ابتلا به پوکی استخوان و شکستگی قرار دارید."
        quiz.hFn.innerHTML= "</br>پس از تکمیل پرسشنامه، در مورد ریسک فاکتورهای مثبت خود از پزشک متخصص کمک بگیرید. در صورت نیاز، پزشک انجام تست تراکم استخوان و یا استفاده از دارو را تجویز می‌کند و یا توصیه‌هایی برای اصلاح الگوی زندگی شما خواهد داشت.";
      }
    }, 1000);
  }
};
window.addEventListener("load", quiz.init);